{"id":316,"date":"2019-12-28T23:30:59","date_gmt":"2019-12-28T23:30:59","guid":{"rendered":"http:\/\/localhost\/Work\/w95theme.com\/?p=316"},"modified":"2019-12-28T23:30:59","modified_gmt":"2019-12-28T23:30:59","slug":"this-site-is-best-viewed-in-netscape","status":"publish","type":"post","link":"https:\/\/demo.brutalistthemes.com\/w95\/2019\/12\/28\/this-site-is-best-viewed-in-netscape\/","title":{"rendered":"This site is best viewed in Netscape"},"content":{"rendered":"\n<p>The Netscape web browser is the general name for a series of web browsers formerly produced by Netscape Communications Corporation, a former subsidiary of AOL. The original browser was once the dominant browser in terms of usage share, but as a result of the first browser war, it lost virtually all of its share to Internet Explorer.<\/p>\n\n\n\n<p>Netscape was discontinued and support for all Netscape browsers and client products was terminated on March 1, 2008.<\/p>\n\n\n\n<p>Netscape Navigator was the name of Netscape&#8217;s web browser from  versions 1.0 through 4.8. The first version of the browser was released  in 1994, known as Mosaic and then Mosaic Netscape until a legal  challenge from the National Center for Supercomputing Applications (makers of NCSA Mosaic, which many of Netscape&#8217;s founders had spent time developing) which led to the name change to Netscape Navigator. The company&#8217;s name also changed from Mosaic Communications Corporation to Netscape Communications Corporation. <\/p>\n\n\n\n<p>The browser was the most advanced available and was an instant  success, becoming market leader while still in beta. Netscape&#8217;s  feature-count and market share continued to grow rapidly after version  1.0 was released. Version 2.0 added a full mail reader called Netscape  Mail, thus transforming Netscape from a mere web browser to an Internet suite.  During this period, both the browser and the suite were known as  Netscape Navigator. Around the same time, AOL started bundling their  software with Microsoft&#8217;s Internet Explorer. <\/p>\n\n\n\n<p>Version 3.0 of Netscape was the first to face any serious competition in the form of Microsoft Internet Explorer 3.0,  but Netscape held off Microsoft&#8217;s challenge and remained the number one  browser for the time. Version 3.0 was also available in a &#8220;Gold&#8221;  version which featured a WYSIWYG  HTML editor (later added to Netscape Communicator as a standard  feature), and was sold as retail software for profit. Netscape 3.0  introduced many new features such as new plug-ins, background colors for  tables, the archive attribute, and the applet element. Netscape  Navigator 3 was the undisputed web browser giant in its time with over  90% share, but it was later eroded by the free Internet Explorer  included with Windows 95. <\/p>\n\n\n\n<p>^ Text from Wikipedia.org, used for the sole purpose of this demo.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Netscape web browser is the general name for a series of web browsers formerly produced by Netscape Communications Corporation, a former subsidiary of AOL. The original browser was once the dominant browser in terms of usage share, but as a result of the first browser war, it lost virtually all of its share to [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":310,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/demo.brutalistthemes.com\/w95\/wp-json\/wp\/v2\/posts\/316"}],"collection":[{"href":"https:\/\/demo.brutalistthemes.com\/w95\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/demo.brutalistthemes.com\/w95\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/demo.brutalistthemes.com\/w95\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/demo.brutalistthemes.com\/w95\/wp-json\/wp\/v2\/comments?post=316"}],"version-history":[{"count":0,"href":"https:\/\/demo.brutalistthemes.com\/w95\/wp-json\/wp\/v2\/posts\/316\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/demo.brutalistthemes.com\/w95\/wp-json\/wp\/v2\/media\/310"}],"wp:attachment":[{"href":"https:\/\/demo.brutalistthemes.com\/w95\/wp-json\/wp\/v2\/media?parent=316"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/demo.brutalistthemes.com\/w95\/wp-json\/wp\/v2\/categories?post=316"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/demo.brutalistthemes.com\/w95\/wp-json\/wp\/v2\/tags?post=316"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}