{"id":337,"date":"2019-12-30T01:14:15","date_gmt":"2019-12-30T01:14:15","guid":{"rendered":"http:\/\/localhost\/Work\/w95theme.com\/?p=337"},"modified":"2019-12-30T01:14:15","modified_gmt":"2019-12-30T01:14:15","slug":"mid-90s-nostalgia","status":"publish","type":"post","link":"https:\/\/demo.brutalistthemes.com\/w95\/2019\/12\/30\/mid-90s-nostalgia\/","title":{"rendered":"Mid-90s nostalgia"},"content":{"rendered":"<div class=\"intro\">\n\tThis is an intro paragraph created with a shortcode<\/div>\n\n\n\n<p>The 1990s were a revolutionary decade for digital technology. Between 1990 and 1997, individual personal computer ownership in the US rose from 15% to 35%. Cell phones of the early-1990s and earlier ones were very large, lacked  extra features, and were used by only a few percent of the population  of even the wealthiest nations. Only a few million people used online  services in 1990, and the World Wide Web had only just been invented. The first web browser went online in 1993 and by 2001, more than 50% of some Western countries had Internet access, and more than 25% had cell phone access. <\/p>\n\n\n<div class=\"pull-left\">\n\tThis is a left side pull-quote created with a shortcode<\/div>\n\n\n\n<p>The &#8220;historical&#8221; World Wide Web project logo designed by Robert Cailliau. <\/p>\n\n\n\n<p>The logo created by The President&#8217;s Council on the Year 2000 Conversion, for use on Y2K.gov On 6 August 1991, CERN, a pan European organization for particle research, publicized the new World Wide Web project.  Although the basic applications and guidelines that make the Internet  possible had existed for almost two decades, the network did not gain a  public face until the 1990s.<\/p>\n\n\n\n<p>Driven by mass adoption, consumer personal computer specifications increased dramatically during the 1990s, from 512 KB RAM 12&nbsp;MHz Turbo XTs in 1990, to 25–66&nbsp;MHz 80486-class processor at the start of the popularization of the World Wide Web mid-decade, to over 1&nbsp;GHz CPUs with close to a gigabyte of RAM by 2000.<\/p>\n\n\n\n<p>Y2K  spread fear throughout the United States and eventually the world in  the last half of the decade, particularly in 1999, about possible  massive computer malfunctions on 1 January 2000. As a result, many  people stocked up on supplies for fear of a worldwide disaster. After  significant effort to upgrade systems on the part of software engineers,  no failures occurred when the clocks rolled over into 2000.<\/p>\n\n\n<div class=\"pull-right\">\n\tThis is a right side pull-quote created with a shortcode<\/div>\n\n\n\n<p>Advancements in computer modems, ISDN, cable modems, and DSL lead to faster connections to the Internet.<\/p>\n\n\n\n<p>The first Pentium microprocessor is introduced and developed by the Intel Corporation.<\/p>\n\n\n\n<p>Email becomes popular; as a result, Microsoft acquires the popular Hotmail webmail service.<\/p>\n\n\n\n<p>Instant messaging and the buddy list feature becomes popular. AIM and ICQ are two early protocols.<\/p>\n\n\n\n<p>Businesses start to build e-commerce websites; e-commerce-only companies such as Amazon.com, eBay, AOL, and Yahoo! grow rapidly.<\/p>\n\n\n\n<p>The introduction of affordable, smaller satellite dishes and the DVB-S standard in the mid-1990s expanded satellite television services that carried up to 500 television channels.<\/p>\n\n\n\n<p>The first MP3 player, the MPMan, is released in late spring of 1998. It came with 32&nbsp;MB of flash memory expandable to 64&nbsp;MB. By the mid-2000s, the MP3 player would overtake the CD player in popularity.<\/p>\n\n\n\n<p>The first GSM network is launched in Finland in 1991.<\/p>\n\n\n\n<p>Digital single-lens reflex cameras and regular digital cameras become commercially available. They would replace film cameras by the mid-2000s.<\/p>\n\n\n\n<p>IBM introduces the 1-inch (25&nbsp;mm) wide Microdrive hard drive in 170 MB and 340 MB capacities.<\/p>\n\n\n\n<p>Apple in 1998 introduces the iMac  all-in-one computer, initiating a trend in computer design towards  translucent plastics and multicolor case design, discontinuing many legacy technologies like serial ports, and beginning a resurgence in the company&#8217;s fortunes that continues to this day.<\/p>\n\n\n\n<p>CD burner drives are introduced.<\/p>\n\n\n\n<p>The CD-ROM drive became standard for most personal computers during the decade.<\/p>\n\n\n\n<p>The DVD media format is developed and popularized along with a plethora of Flash memory card standards in 1994.<\/p>\n\n\n\n<p>Pagers are initially popular but ultimately are replaced by mobile phones by the early-2000s.<\/p>\n\n\n\n<p>Hand-held satellite phones are introduced towards the end of the decade.<\/p>\n\n\n\n<p>Portable CD players,  introduced during the late 1980s, became very popular and had a  profound impact on the music industry and youth culture during the  1990s.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The 1990s were a revolutionary decade for digital technology. Between 1990 and 1997, individual personal computer ownership in the US rose from 15% to 35%. Cell phones of the early-1990s and earlier ones were very large, lacked extra features, and were used by only a few percent of the population of even the wealthiest nations. [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":351,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/demo.brutalistthemes.com\/w95\/wp-json\/wp\/v2\/posts\/337"}],"collection":[{"href":"https:\/\/demo.brutalistthemes.com\/w95\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/demo.brutalistthemes.com\/w95\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/demo.brutalistthemes.com\/w95\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/demo.brutalistthemes.com\/w95\/wp-json\/wp\/v2\/comments?post=337"}],"version-history":[{"count":0,"href":"https:\/\/demo.brutalistthemes.com\/w95\/wp-json\/wp\/v2\/posts\/337\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/demo.brutalistthemes.com\/w95\/wp-json\/wp\/v2\/media\/351"}],"wp:attachment":[{"href":"https:\/\/demo.brutalistthemes.com\/w95\/wp-json\/wp\/v2\/media?parent=337"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/demo.brutalistthemes.com\/w95\/wp-json\/wp\/v2\/categories?post=337"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/demo.brutalistthemes.com\/w95\/wp-json\/wp\/v2\/tags?post=337"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}